rails_chapter6/sample_app/app/controllers/todolists_controller.rb

  def create
    list = List.new(list_params)
    list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "磯野"], ["body", "カツオ"], ["created_at", "2020-10-20 11:11:43.943204"], ["updated_at", "2020-10-20 11:11:43.943204"]]

  def update
    list = List.find(params[:id])
    list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "aaaeee"], ["updated_at", "2020-10-21 02:47:06.564575"], ["id", 1]]